0228GFT/EIDE/STM32/STM32F103C8T6/Project/BSP/OLED/OLED.c

/***************************************************************************************
 * 本程序由江协科技创建并免费开源共享
 * 你可以任意查看、使用和修改，并应用到自己的项目之中
 * 程序版权归江协科技所有，任何人或组织不得将其据为己有
 *
 * 程序名称：				0.96寸OLED显示屏驱动程序（4针脚I2C接口）
 * 程序创建时间：			2023.10.24
 * 当前程序版本：			V2.0
 * 当前版本发布时间：		2024.10.20
 *
 * 江协科技官方网站：		jiangxiekeji.com
 * 江协科技官方淘宝店：	jiangxiekeji.taobao.com
 * 程序介绍及更新动态：	jiangxiekeji.com/tutorial/oled.html
 *
 * 如果你发现程序中的漏洞或者笔误，可通过邮件向我们反馈：feedback@jiangxiekeji.com
 * 发送邮件之前，你可以先到更新动态页面查看最新程序，如果此问题已经修改，则无需再发邮件
 ***************************************************************************************
 */

#include <math.h>
#include <stdarg.h>
#include <stdio.h>
#include <string.h>
#include "stm32f10x.h"
#include "OLED.h"

/**
 * 数据存储格式：
 * 纵向8点，高位在下，先从左到右，再从上到下
 * 每一个Bit对应一个像素点
 *
 *      B0 B0                  B0 B0
 *      B1 B1                  B1 B1
 *      B2 B2                  B2 B2
 *      B3 B3  ------------->  B3 B3 --
 *      B4 B4                  B4 B4  |
 *      B5 B5                  B5 B5  |
 *      B6 B6                  B6 B6  |
 *      B7 B7                  B7 B7  |
 *                                    |
 *  -----------------------------------
 *  |
 *  |   B0 B0                  B0 B0
 *  |   B1 B1                  B1 B1
 *  |   B2 B2                  B2 B2
 *  --> B3 B3  ------------->  B3 B3
 *      B4 B4                  B4 B4
 *      B5 B5                  B5 B5
 *      B6 B6                  B6 B6
 *      B7 B7                  B7 B7
 *
 * 坐标轴定义：
 * 左上角为(0, 0)点
 * 横向向右为X轴，取值范围：0~127
 * 纵向向下为Y轴，取值范围：0~63
 *
 *       0             X轴           127
 *      .------------------------------->
 *    0 |
 *      |
 *      |
 *      |
 *  Y轴 |
 *      |
 *      |
 *      |
 *   63 |
 *      v
 *
 */

/*全局变量*********************/

/**
 * OLED显存数组
 * 所有的显示函数，都只是对此显存数组进行读写
 * 随后调用OLED_Update函数或OLED_UpdateArea函数
 * 才会将显存数组的数据发送到OLED硬件，进行显示
 */
uint8_t OLED_DisplayBuf[8][128];

/*********************全局变量*/

/*引脚配置*********************/

#if OLED_I2C_Software

/**
 * @brief OLED写SCL高低电平
 *
 * @param BitValue 要写入SCL的电平值，范围：0/1
 * @note 当上层函数需要写SCL时，此函数会被调用
 * 	 用户需要根据参数传入的值，将SCL置为高电平或者低电平
 * 	 当参数传入0时，置SCL为低电平，当参数传入1时，置SCL为高电平
 */
void OLED_W_SCL(uint8_t BitValue)
{
	/*根据BitValue的值，将SCL置高电平或者低电平*/
	GPIO_WriteBit(OLED_SCL_Port, OLED_SCL_Pin, (BitAction)BitValue);

	/*如果单片机速度过快，可在此添加适量延时，以避免超出I2C通信的最大速度*/
	//...
}

/**
 * @brief OLED写SDA高低电平
 *
 * @param BitValue 要写入SDA的电平值，范围：0/1
 * @note 当上层函数需要写SDA时，此函数会被调用
 * 	 用户需要根据参数传入的值，将SDA置为高电平或者低电平
 * 	 当参数传入0时，置SDA为低电平，当参数传入1时，置SDA为高电平
 */
void OLED_W_SDA(uint8_t BitValue)
{
	/*根据BitValue的值，将SDA置高电平或者低电平*/
	GPIO_WriteBit(OLED_SDA_Port, OLED_SDA_Pin, (BitAction)BitValue);

	/*如果单片机速度过快，可在此添加适量延时，以避免超出I2C通信的最大速度*/
	//...
}

/**
 * @brief OLED引脚初始化
 *
 * @note 当上层函数需要初始化时，此函数会被调用
 * 	 用户需要将SCL和SDA引脚初始化为输出模式，并释放引脚
 */
void OLED_GPIO_Init(void)
{
	uint32_t i, j;

	/*在初始化前，加入适量延时，待OLED供电稳定*/
	for (i = 0; i < 1000; i++)
	{
		for (j = 0; j < 1000; j++)
			;
	}

	/*将SCL和SDA引脚初始化为开漏模式*/
	RCC_APB2PeriphClockCmd(OLED_RCC_Port, ENABLE);

	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = OLED_SCL_Pin; // SCL引脚
	GPIO_Init(OLED_SCL_Port, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = OLED_SDA_Pin; // SDA引脚
	GPIO_Init(OLED_SDA_Port, &GPIO_InitStructure);

	/*释放SCL和SDA*/
	OLED_W_SCL(1);
	OLED_W_SDA(1);
}

#endif

#if OLED_I2C_HardWare

/**
 * @brief OLED 硬件I2C初始化
 *
 */
void OLED_I2C_Init(void)
{
	// 一、开启时钟
	RCC_APB1PeriphClockCmd(OLED_I2C_RCC_Port, ENABLE);
	RCC_APB2PeriphClockCmd(OLED_I2C_RCC_GPIO_Port, ENABLE);

	// 二、GPIO初始化
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = OLED_I2C_SCL_Pin | OLED_I2C_SDA_Pin;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(OLED_I2C_GPIO_Port, &GPIO_InitStructure);

	// 三、IIC初始化
	I2C_InitTypeDef I2C_InitStructure;
	I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
	I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
	I2C_InitStructure.I2C_ClockSpeed = 200000;
	I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
	I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
	I2C_InitStructure.I2C_OwnAddress1 = 0x00;
	I2C_Init(OLED_I2C_Port, &I2C_InitStructure);

	// 四、IIC使能
	I2C_Cmd(I2C2, ENABLE);
}

#endif

/*********************引脚配置*/

/*通信协议*********************/

#if OLED_I2C_Software

/**
 * @brief I2C起始
 *
 */
void OLED_I2C_Start(void)
{
	OLED_W_SDA(1); // 释放SDA，确保SDA为高电平
	OLED_W_SCL(1); // 释放SCL，确保SCL为高电平
	OLED_W_SDA(0); // 在SCL高电平期间，拉低SDA，产生起始信号
	OLED_W_SCL(0); // 起始后把SCL也拉低，即为了占用总线，也为了方便总线时序的拼接
}

/**
 * @brief I2C终止
 *
 */
void OLED_I2C_Stop(void)
{
	OLED_W_SDA(0); // 拉低SDA，确保SDA为低电平
	OLED_W_SCL(1); // 释放SCL，使SCL呈现高电平
	OLED_W_SDA(1); // 在SCL高电平期间，释放SDA，产生终止信号
}

/**
 * @brief I2C发送一个字节
 *
 * @param Byte 要发送的一个字节数据，范围：0x00~0xFF
 */
void OLED_I2C_SendByte(uint8_t Byte)
{
	uint8_t i;

	/*循环8次，主机依次发送数据的每一位*/
	for (i = 0; i < 8; i++)
	{
		/*使用掩码的方式取出Byte的指定一位数据并写入到SDA线*/
		/*两个!的作用是，让所有非零的值变为1*/
		OLED_W_SDA(!!(Byte & (0x80 >> i)));
		OLED_W_SCL(1); // 释放SCL，从机在SCL高电平期间读取SDA
		OLED_W_SCL(0); // 拉低SCL，主机开始发送下一位数据
	}

	OLED_W_SCL(1); // 额外的一个时钟，不处理应答信号
	OLED_W_SCL(0);
}

#endif

#if OLED_I2C_HardWare

/**
 * @brief 等待I2C事件
 *
 * @param I2Cx I2C外设
 * @param I2C_EVENT 事件
 */
void OLED_WaitEvent(I2C_TypeDef *I2Cx, uint32_t I2C_EVENT)
{
	u32 Timeout = 10000;
	while (!I2C_CheckEvent(I2Cx, I2C_EVENT))
	{
		Timeout--;
		if (!Timeout)
		{
			break;
		}
	}
}

#endif

/**
 * @brief OLED写命令
 *
 * @param Command 要写入的命令值，范围：0x00~0xFF
 */
void OLED_WriteCommand(uint8_t Command)
{

#if OLED_I2C_Software

	OLED_I2C_Start();           // I2C起始
	OLED_I2C_SendByte(0x78);    // 发送OLED的I2C从机地址
	OLED_I2C_SendByte(0x00);    // 控制字节，给0x00，表示即将写命令
	OLED_I2C_SendByte(Command); // 写入指定的命令
	OLED_I2C_Stop();            // I2C终止

#endif

#if OLED_I2C_HardWare

	I2C_GenerateSTART(OLED_I2C_Port, ENABLE);
	OLED_WaitEvent(OLED_I2C_Port, I2C_EVENT_MASTER_MODE_SELECT);

	I2C_Send7bitAddress(OLED_I2C_Port, 0x78, I2C_Direction_Transmitter);
	OLED_WaitEvent(OLED_I2C_Port, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED);

	I2C_SendData(OLED_I2C_Port, 0x00);
	OLED_WaitEvent(OLED_I2C_Port, I2C_EVENT_MASTER_BYTE_TRANSMITTING);

	I2C_SendData(OLED_I2C_Port, Command);
	OLED_WaitEvent(OLED_I2C_Port, I2C_EVENT_MASTER_BYTE_TRANSMITTED);

	I2C_GenerateSTOP(OLED_I2C_Port, ENABLE);

#endif
}

/**
 * @brief OLED写数据
 *
 * @param Data 要写入数据的起始地址
 * @param Count 要写入数据的数量
 */
void OLED_WriteData(uint8_t *Data, uint8_t Count)
{

	uint8_t i;

#if OLED_I2C_Software

	OLED_I2C_Start();        // I2C起始
	OLED_I2C_SendByte(0x78); // 发送OLED的I2C从机地址
	OLED_I2C_SendByte(0x40); // 控制字节，给0x40，表示即将写数据
	/*循环Count次，进行连续的数据写入*/
	for (i = 0; i < Count; i++)
	{
		OLED_I2C_SendByte(Data[i]); // 依次发送Data的每一个数据
	}
	OLED_I2C_Stop(); // I2C终止

#endif

