0228GFT/EIDE/STM32/STM32F103C8T6/Project/BSP/OLED/OLED.c
	while (String[i] != '\0') // 遍历字符串
	{

#ifdef OLED_CHARSET_UTF8 // 定义字符集为UTF8
		/*此段代码的目的是，提取UTF8字符串中的一个字符，转存到SingleChar子字符串中*/
		/*判断UTF8编码第一个字节的标志位*/
		if ((String[i] & 0x80) == 0x00) // 第一个字节为0xxxxxxx
		{
			CharLength = 1;              // 字符为1字节
			SingleChar[0] = String[i++]; // 将第一个字节写入SingleChar第0个位置，随后i指向下一个字节
			SingleChar[1] = '\0';        // 为SingleChar添加字符串结束标志位
		}
		else if ((String[i] & 0xE0) == 0xC0) // 第一个字节为110xxxxx
		{
			CharLength = 2;              // 字符为2字节
			SingleChar[0] = String[i++]; // 将第一个字节写入SingleChar第0个位置，随后i指向下一个字节
			if (String[i] == '\0')
			{
				break;
			} // 意外情况，跳出循环，结束显示
			SingleChar[1] = String[i++]; // 将第二个字节写入SingleChar第1个位置，随后i指向下一个字节
			SingleChar[2] = '\0';        // 为SingleChar添加字符串结束标志位
		}
		else if ((String[i] & 0xF0) == 0xE0) // 第一个字节为1110xxxx
		{
			CharLength = 3; // 字符为3字节
			SingleChar[0] = String[i++];
			if (String[i] == '\0')
			{
				break;
			}
			SingleChar[1] = String[i++];
			if (String[i] == '\0')
			{
				break;
			}
			SingleChar[2] = String[i++];
			SingleChar[3] = '\0';
		}
		else if ((String[i] & 0xF8) == 0xF0) // 第一个字节为11110xxx
		{
			CharLength = 4; // 字符为4字节
			SingleChar[0] = String[i++];
			if (String[i] == '\0')
			{
				break;
			}
			SingleChar[1] = String[i++];
			if (String[i] == '\0')
			{
				break;
			}
			SingleChar[2] = String[i++];
			if (String[i] == '\0')
			{
				break;
			}
			SingleChar[3] = String[i++];
			SingleChar[4] = '\0';
		}
		else
		{
			i++; // 意外情况，i指向下一个字节，忽略此字节，继续判断下一个字节
			continue;
		}
#endif

#ifdef OLED_CHARSET_GB2312 // 定义字符集为GB2312
		/*此段代码的目的是，提取GB2312字符串中的一个字符，转存到SingleChar子字符串中*/
		/*判断GB2312字节的最高位标志位*/
		if ((String[i] & 0x80) == 0x00) // 最高位为0
		{
			CharLength = 1;              // 字符为1字节
			SingleChar[0] = String[i++]; // 将第一个字节写入SingleChar第0个位置，随后i指向下一个字节
			SingleChar[1] = '\0';        // 为SingleChar添加字符串结束标志位
		}
		else // 最高位为1
		{
			CharLength = 2;              // 字符为2字节
			SingleChar[0] = String[i++]; // 将第一个字节写入SingleChar第0个位置，随后i指向下一个字节
			if (String[i] == '\0')
			{
				break;
			} // 意外情况，跳出循环，结束显示
			SingleChar[1] = String[i++]; // 将第二个字节写入SingleChar第1个位置，随后i指向下一个字节
			SingleChar[2] = '\0';        // 为SingleChar添加字符串结束标志位
		}
#endif

		/*显示上述代码提取到的SingleChar*/
		if (CharLength == 1) // 如果是单字节字符
		{
			/*使用OLED_ShowChar显示此字符*/
			OLED_ShowChar(X + XOffset, Y, SingleChar[0], FontSize);
			XOffset += FontSize;
		}
		else // 否则，即多字节字符
		{
			/*遍历整个字模库，从字模库中寻找此字符的数据*/
			/*如果找到最后一个字符（定义为空字符串），则表示字符未在字模库定义，停止寻找*/
			for (pIndex = 0; strcmp(OLED_CF16x16[pIndex].Index, "") != 0; pIndex++)
			{
				/*找到匹配的字符*/
				if (strcmp(OLED_CF16x16[pIndex].Index, SingleChar) == 0)
				{
					break; // 跳出循环，此时pIndex的值为指定字符的索引
				}
			}
			if (FontSize == OLED_8X16) // 给定字体为8*16点阵
			{
				/*将字模库OLED_CF16x16的指定数据以16*16的图像格式显示*/
				OLED_ShowImage(X + XOffset, Y, 16, 16, OLED_CF16x16[pIndex].Data);
				XOffset += 16;
			}
			else if (FontSize == OLED_6X8) // 给定字体为6*8点阵
			{
				/*空间不足，此位置显示'?'*/
				OLED_ShowChar(X + XOffset, Y, '?', OLED_6X8);
				XOffset += OLED_6X8;
			}
		}
	}
}

/**
 * @brief OLED显示数字（十进制，正整数）
 *
 * @param X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @param Number 指定要显示的数字，范围：0~4294967295
 * @param Length 指定数字的长度，范围：0~10
 * @param FontSize 指定字体大小
 * 		 范围：OLED_8X16		宽8像素，高16像素
 * 			  OLED_6X8		宽6像素，高8像素
 * @note 调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_ShowNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i;
	for (i = 0; i < Length; i++) // 遍历数字的每一位
	{
		/*调用OLED_ShowChar函数，依次显示每个数字*/
		/*Number / OLED_Pow(10, Length - i - 1) % 10 可以十进制提取数字的每一位*/
		/*+ '0' 可将数字转换为字符格式*/
		OLED_ShowChar(X + i * FontSize, Y, Number / OLED_Pow(10, Length - i - 1) % 10 + '0', FontSize);
	}
}

/**
 * @brief OLED显示有符号数字（十进制，整数）
 *
 * @param X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @param Number 指定要显示的数字，范围：-2147483648~2147483647
 * @param Length 指定数字的长度，范围：0~10
 * @param FontSize 指定字体大小
 * 		 范围：OLED_8X16		宽8像素，高16像素
 * 			  OLED_6X8		宽6像素，高8像素
 * @note 调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_ShowSignedNum(int16_t X, int16_t Y, int32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i;
	uint32_t Number1;

	if (Number >= 0) // 数字大于等于0
	{
		OLED_ShowChar(X, Y, '+', FontSize); // 显示+号
		Number1 = Number;                   // Number1直接等于Number
	}
	else // 数字小于0
	{
		OLED_ShowChar(X, Y, '-', FontSize); // 显示-号
		Number1 = -Number;                  // Number1等于Number取负
	}

	for (i = 0; i < Length; i++) // 遍历数字的每一位
	{
		/*调用OLED_ShowChar函数，依次显示每个数字*/
		/*Number1 / OLED_Pow(10, Length - i - 1) % 10 可以十进制提取数字的每一位*/
		/*+ '0' 可将数字转换为字符格式*/
		OLED_ShowChar(X + (i + 1) * FontSize, Y, Number1 / OLED_Pow(10, Length - i - 1) % 10 + '0', FontSize);
	}
}

/**
 * @brief OLED显示十六进制数字（十六进制，正整数）
 *
 * @param X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @param Number 指定要显示的数字，范围：0x00000000~0xFFFFFFFF
 * @param Length 指定数字的长度，范围：0~8
 * @param FontSize 指定字体大小
 * 		 范围：OLED_8X16		宽8像素，高16像素
 * 			  OLED_6X8		宽6像素，高8像素
 * @note 调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_ShowHexNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i, SingleNumber;
	for (i = 0; i < Length; i++) // 遍历数字的每一位
	{
		/*以十六进制提取数字的每一位*/
		SingleNumber = Number / OLED_Pow(16, Length - i - 1) % 16;

		if (SingleNumber < 10) // 单个数字小于10
		{
			/*调用OLED_ShowChar函数，显示此数字*/
			/*+ '0' 可将数字转换为字符格式*/
			OLED_ShowChar(X + i * FontSize, Y, SingleNumber + '0', FontSize);
		}
		else // 单个数字大于10
		{
			/*调用OLED_ShowChar函数，显示此数字*/
			/*+ 'A' 可将数字转换为从A开始的十六进制字符*/
			OLED_ShowChar(X + i * FontSize, Y, SingleNumber - 10 + 'A', FontSize);
		}
	}
}

/**
 * @brief OLED显示二进制数字（二进制，正整数）
 *
 * @param X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @param Number 指定要显示的数字，范围：0x00000000~0xFFFFFFFF
 * @param Length 指定数字的长度，范围：0~16
 * @param FontSize 指定字体大小
 * 		 范围：OLED_8X16		宽8像素，高16像素
 * 			  OLED_6X8		宽6像素，高8像素
 * @note 调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_ShowBinNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i;
	for (i = 0; i < Length; i++) // 遍历数字的每一位
	{
		/*调用OLED_ShowChar函数，依次显示每个数字*/
		/*Number / OLED_Pow(2, Length - i - 1) % 2 可以二进制提取数字的每一位*/
		/*+ '0' 可将数字转换为字符格式*/
		OLED_ShowChar(X + i * FontSize, Y, Number / OLED_Pow(2, Length - i - 1) % 2 + '0', FontSize);
	}
}

/**
 * @brief OLED显示浮点数字（十进制，小数）
 *
 * @param X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @param Number 指定要显示的数字，范围：-4294967295.0~4294967295.0
 * @param IntLength 指定数字的整数位长度，范围：0~10
 * @param FraLength 指定数字的小数位长度，范围：0~9，小数进行四舍五入显示
 * @param FontSize 指定字体大小
 * 		 范围：OLED_8X16		宽8像素，高16像素
 * 			  OLED_6X8		宽6像素，高8像素
 * @note 调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_ShowFloatNum(int16_t X, int16_t Y, double Number, uint8_t IntLength, uint8_t FraLength, uint8_t FontSize)
{
	uint32_t PowNum, IntNum, FraNum;

