0228GFT/EIDE/STM32/STM32F103C8T6/Project/BSP/OLED/OLED.c
	if (Number >= 0) // 数字大于等于0
	{
		OLED_ShowChar(X, Y, '+', FontSize); // 显示+号
	}
	else // 数字小于0
	{
		OLED_ShowChar(X, Y, '-', FontSize); // 显示-号
		Number = -Number;                   // Number取负
	}

	/*提取整数部分和小数部分*/
	IntNum = Number;                  // 直接赋值给整型变量，提取整数
	Number -= IntNum;                 // 将Number的整数减掉，防止之后将小数乘到整数时因数过大造成错误
	PowNum = OLED_Pow(10, FraLength); // 根据指定小数的位数，确定乘数
	FraNum = round(Number * PowNum);  // 将小数乘到整数，同时四舍五入，避免显示误差
	IntNum += FraNum / PowNum;        // 若四舍五入造成了进位，则需要再加给整数

	/*显示整数部分*/
	OLED_ShowNum(X + FontSize, Y, IntNum, IntLength, FontSize);

	/*显示小数点*/
	OLED_ShowChar(X + (IntLength + 1) * FontSize, Y, '.', FontSize);

	/*显示小数部分*/
	OLED_ShowNum(X + (IntLength + 2) * FontSize, Y, FraNum, FraLength, FontSize);
}

/**
 * @brief OLED显示图像
 *
 * @param X 指定图像左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y 指定图像左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @param Width 指定图像的宽度，范围：0~128
 * @param Height 指定图像的高度，范围：0~64
 * @param Image 指定要显示的图像
 * @note 调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_ShowImage(int16_t X, int16_t Y, uint8_t Width, uint8_t Height, const uint8_t *Image)
{
	uint8_t i = 0, j = 0;
	int16_t Page, Shift;

	/*将图像所在区域清空*/
	OLED_ClearArea(X, Y, Width, Height);

	/*遍历指定图像涉及的相关页*/
	/*(Height - 1) / 8 + 1的目的是Height / 8并向上取整*/
	for (j = 0; j < (Height - 1) / 8 + 1; j++)
	{
		/*遍历指定图像涉及的相关列*/
		for (i = 0; i < Width; i++)
		{
			if (X + i >= 0 && X + i <= 127) // 超出屏幕的内容不显示
			{
				/*负数坐标在计算页地址和移位时需要加一个偏移*/
				Page = Y / 8;
				Shift = Y % 8;
				if (Y < 0)
				{
					Page -= 1;
					Shift += 8;
				}

				if (Page + j >= 0 && Page + j <= 7) // 超出屏幕的内容不显示
				{
					/*显示图像在当前页的内容*/
					OLED_DisplayBuf[Page + j][X + i] |= Image[j * Width + i] << (Shift);
				}

				if (Page + j + 1 >= 0 && Page + j + 1 <= 7) // 超出屏幕的内容不显示
				{
					/*显示图像在下一页的内容*/
					OLED_DisplayBuf[Page + j + 1][X + i] |= Image[j * Width + i] >> (8 - Shift);
				}
			}
		}
	}
}

/**
 * @brief OLED使用printf函数打印格式化字符串（支持ASCII码和中文混合写入）
 *
 * @param X 指定格式化字符串左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y 指定格式化字符串左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @param FontSize 指定字体大小
 * 		 范围：OLED_8X16		宽8像素，高16像素
 * 			  OLED_6X8		宽6像素，高8像素
 * @param format 指定要显示的格式化字符串，范围：ASCII码可见字符或中文字符组成的字符串
 * @param ... 格式化字符串参数列表
 * @note 显示的中文字符需要在OLED_Data.c里的OLED_CF16x16数组定义
 * 	 如果未找到指定中文字符时，会显示默认图形（一个方框，内部一个问号）
 * 	 当字体大小为OLED_8X16时，中文字符以16*16点阵正常显示
 * 	 当字体大小为OLED_6X8时，中文字符以6*8点阵显示'?'
 * @note 调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_Printf(int16_t X, int16_t Y, uint8_t FontSize, char *format, ...)
{
	char String[256]; // 定义字符数组
	va_list arg;      // 定义可变参数列表数据类型的变量arg

	OLED_ClearArea(X, Y, 128 - X, FontSize * 4 - 16); // 清除X坐标到屏幕最右侧，FontSize高度的区域

	va_start(arg, format);                   // 从format开始，接收参数列表到arg变量
	vsprintf(String, format, arg);           // 使用vsprintf打印格式化字符串和参数列表到字符数组中
	va_end(arg);                             // 结束变量arg
	OLED_ShowString(X, Y, String, FontSize); // OLED显示字符数组（字符串）
}

/**
 * @brief OLED在指定位置画一个点
 *
 * @param X 指定点的横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y 指定点的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @note 调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_DrawPoint(int16_t X, int16_t Y)
{
	if (X >= 0 && X <= 127 && Y >= 0 && Y <= 63) // 超出屏幕的内容不显示
	{
		/*将显存数组指定位置的一个Bit数据置1*/
		OLED_DisplayBuf[Y / 8][X] |= 0x01 << (Y % 8);
	}
}

/**
 * @brief OLED获取指定位置点的值
 *
 * @param X 指定点的横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y 指定点的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @return uint8_t 指定位置点是否处于点亮状态，1：点亮，0：熄灭
 */
uint8_t OLED_GetPoint(int16_t X, int16_t Y)
{
	if (X >= 0 && X <= 127 && Y >= 0 && Y <= 63) // 超出屏幕的内容不读取
	{
		/*判断指定位置的数据*/
		if (OLED_DisplayBuf[Y / 8][X] & 0x01 << (Y % 8))
		{
			return 1; // 为1，返回1
		}
	}

	return 0; // 否则，返回0
}

/**
 * @brief OLED画线
 *
 * @param X0 指定一个端点的横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y0 指定一个端点的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @param X1 指定另一个端点的横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y1 指定另一个端点的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @note 调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_DrawLine(int16_t X0, int16_t Y0, int16_t X1, int16_t Y1)
{
	int16_t x, y, dx, dy, d, incrE, incrNE, temp;
	int16_t x0 = X0, y0 = Y0, x1 = X1, y1 = Y1;
	uint8_t yflag = 0, xyflag = 0;

	if (y0 == y1) // 横线单独处理
	{
		/*0号点X坐标大于1号点X坐标，则交换两点X坐标*/
		if (x0 > x1)
		{
			temp = x0;
			x0 = x1;
			x1 = temp;
		}

		/*遍历X坐标*/
		for (x = x0; x <= x1; x++)
		{
			OLED_DrawPoint(x, y0); // 依次画点
		}
	}
	else if (x0 == x1) // 竖线单独处理
	{
		/*0号点Y坐标大于1号点Y坐标，则交换两点Y坐标*/
		if (y0 > y1)
		{
			temp = y0;
			y0 = y1;
			y1 = temp;
		}

		/*遍历Y坐标*/
		for (y = y0; y <= y1; y++)
		{
			OLED_DrawPoint(x0, y); // 依次画点
		}
	}
	else // 斜线
	{
		/*使用Bresenham算法画直线，可以避免耗时的浮点运算，效率更高*/
		/*参考文档：https://www.cs.montana.edu/courses/spring2009/425/dslectures/Bresenham.pdf*/
		/*参考教程：https://www.bilibili.com/video/BV1364y1d7Lo*/

		if (x0 > x1) // 0号点X坐标大于1号点X坐标
		{
			/*交换两点坐标*/
			/*交换后不影响画线，但是画线方向由第一、二、三、四象限变为第一、四象限*/
			temp = x0;
			x0 = x1;
			x1 = temp;
			temp = y0;
			y0 = y1;
			y1 = temp;
		}

		if (y0 > y1) // 0号点Y坐标大于1号点Y坐标
		{
			/*将Y坐标取负*/
			/*取负后影响画线，但是画线方向由第一、四象限变为第一象限*/
			y0 = -y0;
			y1 = -y1;

			/*置标志位yflag，记住当前变换，在后续实际画线时，再将坐标换回来*/
			yflag = 1;
		}

		if (y1 - y0 > x1 - x0) // 画线斜率大于1
		{
			/*将X坐标与Y坐标互换*/
			/*互换后影响画线，但是画线方向由第一象限0~90度范围变为第一象限0~45度范围*/
			temp = x0;
			x0 = y0;
			y0 = temp;
			temp = x1;
			x1 = y1;
			y1 = temp;

			/*置标志位xyflag，记住当前变换，在后续实际画线时，再将坐标换回来*/
			xyflag = 1;
		}

		/*以下为Bresenham算法画直线*/
		/*算法要求，画线方向必须为第一象限0~45度范围*/
		dx = x1 - x0;
		dy = y1 - y0;
		incrE = 2 * dy;
		incrNE = 2 * (dy - dx);
		d = 2 * dy - dx;
		x = x0;
		y = y0;

		/*画起始点，同时判断标志位，将坐标换回来*/
		if (yflag && xyflag)
		{
			OLED_DrawPoint(y, -x);
		}
		else if (yflag)
		{
			OLED_DrawPoint(x, -y);
		}
		else if (xyflag)
		{
			OLED_DrawPoint(y, x);
		}
		else
		{
			OLED_DrawPoint(x, y);
		}

		while (x < x1) // 遍历X轴的每个点
		{
			x++;
			if (d < 0) // 下一个点在当前点东方
			{
				d += incrE;
			}
			else // 下一个点在当前点东北方
			{
				y++;
				d += incrNE;
			}

			/*画每一个点，同时判断标志位，将坐标换回来*/
			if (yflag && xyflag)
			{
				OLED_DrawPoint(y, -x);
			}
			else if (yflag)
			{
				OLED_DrawPoint(x, -y);
			}
			else if (xyflag)
			{
				OLED_DrawPoint(y, x);
			}
			else
			{
				OLED_DrawPoint(x, y);
			}
		}
	}
}

/**
 * @brief OLED矩形
 *
 * @param X 指定矩形左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y 指定矩形左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @param Width 指定矩形的宽度，范围：0~128
 * @param Height 指定矩形的高度，范围：0~64
 * @param IsFilled 指定矩形是否填充
 * 		 范围：OLED_UNFILLED		不填充
 * 			  OLED_FILLED			填充
 * @note 调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_DrawRectangle(int16_t X, int16_t Y, uint8_t Width, uint8_t Height, uint8_t IsFilled)
{
	int16_t i, j;
	if (!IsFilled) // 指定矩形不填充
	{
		/*遍历上下X坐标，画矩形上下两条线*/
		for (i = X; i < X + Width; i++)
		{
			OLED_DrawPoint(i, Y);
			OLED_DrawPoint(i, Y + Height - 1);
		}
		/*遍历左右Y坐标，画矩形左右两条线*/
		for (i = Y; i < Y + Height; i++)
		{
			OLED_DrawPoint(X, i);
			OLED_DrawPoint(X + Width - 1, i);
		}
	}
	else // 指定矩形填充
	{
		/*遍历X坐标*/
		for (i = X; i < X + Width; i++)
		{
			/*遍历Y坐标*/
			for (j = Y; j < Y + Height; j++)
			{
				/*在指定区域画点，填充满矩形*/
				OLED_DrawPoint(i, j);
			}
		}
	}
}

/**
 * @brief OLED三角形
 *
 * @param X0 指定第一个端点的横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y0 指定第一个端点的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @param X1 指定第二个端点的横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y1 指定第二个端点的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @param X2 指定第三个端点的横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y2 指定第三个端点的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @param IsFilled 指定三角形是否填充
 * 		 范围：OLED_UNFILLED		不填充
 * 			  OLED_FILLED			填充
 */
void OLED_DrawTriangle(int16_t X0, int16_t Y0, int16_t X1, int16_t Y1, int16_t X2, int16_t Y2, uint8_t IsFilled)
{
	int16_t minx = X0, miny = Y0, maxx = X0, maxy = Y0;
	int16_t i, j;
	int16_t vx[] = {X0, X1, X2};
	int16_t vy[] = {Y0, Y1, Y2};

	if (!IsFilled) // 指定三角形不填充
	{
		/*调用画线函数，将三个点用直线连接*/
		OLED_DrawLine(X0, Y0, X1, Y1);
		OLED_DrawLine(X0, Y0, X2, Y2);
		OLED_DrawLine(X1, Y1, X2, Y2);
	}
	else // 指定三角形填充
	{
		/*找到三个点最小的X、Y坐标*/
		if (X1 < minx)
		{
			minx = X1;
		}
		if (X2 < minx)
		{
			minx = X2;
		}
		if (Y1 < miny)
		{
			miny = Y1;
		}
		if (Y2 < miny)
		{
			miny = Y2;
		}

