0228GFT/EIDE/STM32/STM32F103C8T6/Project/BSP/OLED/OLED.c
		/*找到三个点最大的X、Y坐标*/
		if (X1 > maxx)
		{
			maxx = X1;
		}
		if (X2 > maxx)
		{
			maxx = X2;
		}
		if (Y1 > maxy)
		{
			maxy = Y1;
		}
		if (Y2 > maxy)
		{
			maxy = Y2;
		}

		/*最小最大坐标之间的矩形为可能需要填充的区域*/
		/*遍历此区域中所有的点*/
		/*遍历X坐标*/
		for (i = minx; i <= maxx; i++)
		{
			/*遍历Y坐标*/
			for (j = miny; j <= maxy; j++)
			{
				/*调用OLED_pnpoly，判断指定点是否在指定三角形之中*/
				/*如果在，则画点，如果不在，则不做处理*/
				if (OLED_pnpoly(3, vx, vy, i, j))
				{
					OLED_DrawPoint(i, j);
				}
			}
		}
	}
}

/**
 * @brief OLED画圆
 *
 * @param X 指定圆的圆心横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y 指定圆的圆心纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @param Radius 指定圆的半径，范围：0~255
 * @param IsFilled 指定圆是否填充
 * 		 范围：OLED_UNFILLED		不填充
 * 			  OLED_FILLED			填充
 * @note 调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_DrawCircle(int16_t X, int16_t Y, uint8_t Radius, uint8_t IsFilled)
{
	int16_t x, y, d, j;

	/*使用Bresenham算法画圆，可以避免耗时的浮点运算，效率更高*/
	/*参考文档：https://www.cs.montana.edu/courses/spring2009/425/dslectures/Bresenham.pdf*/
	/*参考教程：https://www.bilibili.com/video/BV1VM4y1u7wJ*/

	d = 1 - Radius;
	x = 0;
	y = Radius;

	/*画每个八分之一圆弧的起始点*/
	OLED_DrawPoint(X + x, Y + y);
	OLED_DrawPoint(X - x, Y - y);
	OLED_DrawPoint(X + y, Y + x);
	OLED_DrawPoint(X - y, Y - x);

	if (IsFilled) // 指定圆填充
	{
		/*遍历起始点Y坐标*/
		for (j = -y; j < y; j++)
		{
			/*在指定区域画点，填充部分圆*/
			OLED_DrawPoint(X, Y + j);
		}
	}

	while (x < y) // 遍历X轴的每个点
	{
		x++;
		if (d < 0) // 下一个点在当前点东方
		{
			d += 2 * x + 1;
		}
		else // 下一个点在当前点东南方
		{
			y--;
			d += 2 * (x - y) + 1;
		}

		/*画每个八分之一圆弧的点*/
		OLED_DrawPoint(X + x, Y + y);
		OLED_DrawPoint(X + y, Y + x);
		OLED_DrawPoint(X - x, Y - y);
		OLED_DrawPoint(X - y, Y - x);
		OLED_DrawPoint(X + x, Y - y);
		OLED_DrawPoint(X + y, Y - x);
		OLED_DrawPoint(X - x, Y + y);
		OLED_DrawPoint(X - y, Y + x);

		if (IsFilled) // 指定圆填充
		{
			/*遍历中间部分*/
			for (j = -y; j < y; j++)
			{
				/*在指定区域画点，填充部分圆*/
				OLED_DrawPoint(X + x, Y + j);
				OLED_DrawPoint(X - x, Y + j);
			}

			/*遍历两侧部分*/
			for (j = -x; j < x; j++)
			{
				/*在指定区域画点，填充部分圆*/
				OLED_DrawPoint(X - y, Y + j);
				OLED_DrawPoint(X + y, Y + j);
			}
		}
	}
}

/**
 * @brief OLED画椭圆
 *
 * @param X 指定椭圆的圆心横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y 指定椭圆的圆心纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @param A 指定椭圆的横向半轴长度，范围：0~255
 * @param B 指定椭圆的纵向半轴长度，范围：0~255
 * @param IsFilled 指定椭圆是否填充
 * 		 范围：OLED_UNFILLED		不填充
 * 			  OLED_FILLED			填充
 * @note 调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_DrawEllipse(int16_t X, int16_t Y, uint8_t A, uint8_t B, uint8_t IsFilled)
{
	int16_t x, y, j;
	int16_t a = A, b = B;
	float d1, d2;

	/*使用Bresenham算法画椭圆，可以避免部分耗时的浮点运算，效率更高*/
	/*参考链接：https://blog.csdn.net/myf_666/article/details/128167392*/

	x = 0;
	y = b;
	d1 = b * b + a * a * (-b + 0.5);

	if (IsFilled) // 指定椭圆填充
	{
		/*遍历起始点Y坐标*/
		for (j = -y; j < y; j++)
		{
			/*在指定区域画点，填充部分椭圆*/
			OLED_DrawPoint(X, Y + j);
			OLED_DrawPoint(X, Y + j);
		}
	}

	/*画椭圆弧的起始点*/
	OLED_DrawPoint(X + x, Y + y);
	OLED_DrawPoint(X - x, Y - y);
	OLED_DrawPoint(X - x, Y + y);
	OLED_DrawPoint(X + x, Y - y);

	/*画椭圆中间部分*/
	while (b * b * (x + 1) < a * a * (y - 0.5))
	{
		if (d1 <= 0) // 下一个点在当前点东方
		{
			d1 += b * b * (2 * x + 3);
		}
		else // 下一个点在当前点东南方
		{
			d1 += b * b * (2 * x + 3) + a * a * (-2 * y + 2);
			y--;
		}
		x++;

		if (IsFilled) // 指定椭圆填充
		{
			/*遍历中间部分*/
			for (j = -y; j < y; j++)
			{
				/*在指定区域画点，填充部分椭圆*/
				OLED_DrawPoint(X + x, Y + j);
				OLED_DrawPoint(X - x, Y + j);
			}
		}

		/*画椭圆中间部分圆弧*/
		OLED_DrawPoint(X + x, Y + y);
		OLED_DrawPoint(X - x, Y - y);
		OLED_DrawPoint(X - x, Y + y);
		OLED_DrawPoint(X + x, Y - y);
	}

	/*画椭圆两侧部分*/
	d2 = b * b * (x + 0.5) * (x + 0.5) + a * a * (y - 1) * (y - 1) - a * a * b * b;

	while (y > 0)
	{
		if (d2 <= 0) // 下一个点在当前点东方
		{
			d2 += b * b * (2 * x + 2) + a * a * (-2 * y + 3);
			x++;
		}
		else // 下一个点在当前点东南方
		{
			d2 += a * a * (-2 * y + 3);
		}
		y--;

		if (IsFilled) // 指定椭圆填充
		{
			/*遍历两侧部分*/
			for (j = -y; j < y; j++)
			{
				/*在指定区域画点，填充部分椭圆*/
				OLED_DrawPoint(X + x, Y + j);
				OLED_DrawPoint(X - x, Y + j);
			}
		}

		/*画椭圆两侧部分圆弧*/
		OLED_DrawPoint(X + x, Y + y);
		OLED_DrawPoint(X - x, Y - y);
		OLED_DrawPoint(X - x, Y + y);
		OLED_DrawPoint(X + x, Y - y);
	}
}

/**
 * @brief OLED画圆弧
 *
 * @param X 指定圆弧的圆心横坐标，范围：-32768~32767，屏幕区域：0~127
 * @param Y 指定圆弧的圆心纵坐标，范围：-32768~32767，屏幕区域：0~63
 * @param Radius 指定圆弧的半径，范围：0~255
 * @param StartAngle 指定圆弧的起始角度，范围：-180~180
 * 		 水平向右为0度，水平向左为180度或-180度，下方为正数，上方为负数，顺时针旋转
 * @param EndAngle 指定圆弧的终止角度，范围：-180~180
 * 		 水平向右为0度，水平向左为180度或-180度，下方为正数，上方为负数，顺时针旋转
 * @param IsFilled 指定圆弧是否填充，填充后为扇形
 * 		 范围：OLED_UNFILLED		不填充
 * 			  OLED_FILLED			填充
 * @note 调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_DrawArc(int16_t X, int16_t Y, uint8_t Radius, int16_t StartAngle, int16_t EndAngle, uint8_t IsFilled)
{
	int16_t x, y, d, j;

	/*此函数借用Bresenham算法画圆的方法*/

	d = 1 - Radius;
	x = 0;
	y = Radius;

	/*在画圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理*/
	if (OLED_IsInAngle(x, y, StartAngle, EndAngle))
	{
		OLED_DrawPoint(X + x, Y + y);
	}
	if (OLED_IsInAngle(-x, -y, StartAngle, EndAngle))
	{
		OLED_DrawPoint(X - x, Y - y);
	}
	if (OLED_IsInAngle(y, x, StartAngle, EndAngle))
	{
		OLED_DrawPoint(X + y, Y + x);
	}
	if (OLED_IsInAngle(-y, -x, StartAngle, EndAngle))
	{
		OLED_DrawPoint(X - y, Y - x);
	}

	if (IsFilled) // 指定圆弧填充
	{
		/*遍历起始点Y坐标*/
		for (j = -y; j < y; j++)
		{
			/*在填充圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理*/
			if (OLED_IsInAngle(0, j, StartAngle, EndAngle))
			{
				OLED_DrawPoint(X, Y + j);
			}
		}
	}

	while (x < y) // 遍历X轴的每个点
	{
		x++;
		if (d < 0) // 下一个点在当前点东方
		{
			d += 2 * x + 1;
		}
		else // 下一个点在当前点东南方
		{
			y--;
			d += 2 * (x - y) + 1;
		}

		/*在画圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理*/
		if (OLED_IsInAngle(x, y, StartAngle, EndAngle))
		{
			OLED_DrawPoint(X + x, Y + y);
		}
		if (OLED_IsInAngle(y, x, StartAngle, EndAngle))
		{
			OLED_DrawPoint(X + y, Y + x);
		}
		if (OLED_IsInAngle(-x, -y, StartAngle, EndAngle))
		{
			OLED_DrawPoint(X - x, Y - y);
		}
		if (OLED_IsInAngle(-y, -x, StartAngle, EndAngle))
		{
			OLED_DrawPoint(X - y, Y - x);
		}
		if (OLED_IsInAngle(x, -y, StartAngle, EndAngle))
		{
			OLED_DrawPoint(X + x, Y - y);
		}
		if (OLED_IsInAngle(y, -x, StartAngle, EndAngle))
		{
			OLED_DrawPoint(X + y, Y - x);
		}
		if (OLED_IsInAngle(-x, y, StartAngle, EndAngle))
		{
			OLED_DrawPoint(X - x, Y + y);
		}
		if (OLED_IsInAngle(-y, x, StartAngle, EndAngle))
		{
			OLED_DrawPoint(X - y, Y + x);
		}

		if (IsFilled) // 指定圆弧填充
		{
			/*遍历中间部分*/
			for (j = -y; j < y; j++)
			{
				/*在填充圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理*/
				if (OLED_IsInAngle(x, j, StartAngle, EndAngle))
				{
					OLED_DrawPoint(X + x, Y + j);
				}
				if (OLED_IsInAngle(-x, j, StartAngle, EndAngle))
				{
					OLED_DrawPoint(X - x, Y + j);
				}
			}

			/*遍历两侧部分*/
			for (j = -x; j < x; j++)
			{
				/*在填充圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理*/
				if (OLED_IsInAngle(-y, j, StartAngle, EndAngle))
				{
					OLED_DrawPoint(X - y, Y + j);
				}
				if (OLED_IsInAngle(y, j, StartAngle, EndAngle))
				{
					OLED_DrawPoint(X + y, Y + j);
				}
			}
		}
	}
}

/**
 * @brief OLED测试函数
 * 
 */
void OLED_Test(void)
{
	OLED_Init();

	OLED_Printf(0, 0, OLED_8X16, "OLED Test");
	OLED_Update();
}

/*********************功能函数*/

/*****************江协科技|版权所有****************/
/*****************jiangxiekeji.com*****************/
